module.exports.config = {
    name: "autotime",
  version: "1.0.0",
  permission: 0,
  credits: "Nayan",
  description: "msg",
  prefix: true, 
  category: "user", 
  usages: "",
  cooldowns: 5,
  dependencies: {
	}
};
const nam = [{
    timer: '12:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-রাত⏰ 11:00 𝐏𝐌\n\n📌 এখন রাত 11টা বাজে সবাই ঘুমায় পড়ো আমার বউ নাই ভাই তাই ঘুম ও আসে না.']
},
             {
    timer: '1:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-রাত⏰ 12:00 𝐀𝐌\n\n📌 যদি জেগে থাকো তাহাজ্জুদ এর নামাজ পড়ে নাও 🥰']
},
						{
    timer: '2:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-রাত⏰ 01:00 𝐀𝐌\n\n📌 সবাই এখন গিটার বাজানো বন্ধ কর 🤐']
},
						 {
    timer: '3:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-রাত⏰ 02:00 𝐀𝐌\n\n📌 অনেক তো গিটার বাজাইছো এবার একটু ঘুমাও 😒']
},
						 {
    timer: '4:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-রাত⏰ 03:00 𝐀𝐌\n\n📌 কে কে এখনো ঘুমাও নাই আমার মত 🥺']
},
						 {
    timer: '5:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-রাত⏰ 04:00 𝐀𝐌\n\n📌  একটু পরে ফজরের আজান হবে নামাজ পড়ে নিও সবাই 😊']
},
						 {
    timer: '6:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-ভোর⏰ 05:00 𝐀𝐌\n\n📌 ভোর হয়ে গেল এখনো ঘুম থেকে ওঠো নাই কিভাবে উঠবে সারারাত তো google ক্রমে ছিলা 😑']
},
						 {
    timer: '7:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-সকাল⏰ 06:00 𝐀𝐌\n\n📌 শুভ সকাল সবাইকে ☺']
},
						 {
    timer: '8:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-সকাল⏰ 07:00 𝐀𝐌\n\n📌 যে যার কাজে বেরিয়ে পড়ো 😢']
},
						 {
    timer: '9:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-সকাল⏰ 08:00 𝐀𝐌\n\n📌 এখনো অনেক জমিদারের বাচ্চারা ঘুমিয়ে আছে 🙄']
},
             {
    timer: '10:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-সকাল⏰ 09:00 𝐀𝐌\n\n📌 তোমাদেরকে ডাকতে ডাকতে নয়টা বেজে গেল এবার তো ঘুম থেকে ওঠো 😐' ]
},
						 {
    timer: '11:00:00 AM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-সকাল⏰ 10:00 𝐀𝐌\n\n📌 কিছু জমিদারের বাচ্চারা এখন ঘুম থেকে উঠে ফ্রেশ হবে 😟 ']
},
						 {
    timer: '12:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-সকাল⏰ 11:00 𝐀𝐌\n\n📌  অনেক তো কাজ করেছ যাও এখন হালকা নাস্তা করে এসো ☺']
},					
						 {
    timer: '1:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-দুপুর⏰ 12:00 𝐏𝐌\n\n📌  দুপুর ১২ টা মানেই আর একটু পরে আল্লাহ তোমাকে আল্লাহর ঘরে ডাক দিবে 💚']
},
						 {
    timer: '2:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-দুপুর⏰ 01:00 𝐏𝐌\n\n📌 এখন যোহরের আজান হবে সবাই ফ্রেশ হয়ে নামাজে যাও 🚶']
},
						 {
    timer: '3:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-দুপুর⏰ 02:00 𝐏𝐌\n\n📌 এখন দুপুর ২টা বাজে সবাই দুপুরের খাবার খেয়ে নাও😎']
},
						 {
    timer: '4:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-দুপুর⏰ 03:00 𝐏𝐌\n\n 📌 এখন দুপুর ৩টা বাজে সারাদিন কাজ করছো এবার একটু ঘুমাও:(']
},
						{
    timer: '5:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-বিকাল⏰ 04:00 𝐏𝐌\n\n📌 এখন বিকাল ৪টা বাজে বড়দের স্কুল ছুটি দিয়ে দিছে চল মেয়ে দেখে আসি😸 ']
},
						 {
    timer: '6:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-বিকাল⏰ 05:00 𝐏𝐌\n\n📌 এখন বিকাল ৫টা বাজে একটু পর আসরের আযান দিবে সবাই নামাজ পড়ে নিও 😎']
},
						 {
    timer: '7:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-সন্ধ্যা⏰ 06:00 𝐏𝐌\n\n📌 এখন সন্ধ্যা ৬টা বাজে মাগরিবের আযান দিলে সবাই নামাজ পড়ে নাও🥀 নামাজ পড়ে বাড়িতে এসে কিছু খেয়ে নাও এবং পরিবারের সাথে সময় কাটাও🙏']
},
             {
    timer: '8:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-সন্ধ্যা⏰ 07:00 𝐏𝐌\n\n📌 এখন সন্ধ্যা ৭ টা বাজে নামাজ শেষ করে সবাই বই নিয়ে পড়তে বসো😎']
},
             {
    timer: '9:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-রাত⏰ 08:00 𝐏𝐌\n\n📌 এখন রাত ৮টা বাজে একটু পর এশারের আযান দিবে সবাই নামাজ পড়ে নিও❤']
},
             {
    timer: '10:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-রাত⏰ 09:00 𝐏𝐌\n\n📌 এখন কিছু গাঁজা খোররা নদীর পাশে বসে গাঁজা টানবে 🙄']
},
            {
    timer: '11:00:00 PM',
    message: ['❁𝗠𝗗 𝗔𝗟𝗔𝗠𝗜𝗡 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬𖠌:\n▬▬▬▬▬▬▬▬▬▬▬▬\n🔔-এখন-সময়-রাত⏰ 10:00 𝐏𝐌\n\n📌 এখন রাত ১০টা বাজে সবাই রাতের খাবার খেয়ে ঘুমাও🥰']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};